var smiles=['001','005','007','006','010','018','022','019','026','034','033','037','038','036','040','039','043','049','052','056','059','057','062','066','068','073','082','080','079','083','086','085','114','118','119','123','161','158','164','167','166','170','174','177','175','179','178','186','189','188','190','202','205','203','206','221','237','239','238','243','246','254','253','255','277','276','275','278','284','289','288','294','293','295','310','313','324','336','347','346','345','348','349','351','352','361','362','366','367','382','393','411','415','413','419','422','434','442','447','453','467','471','472','475','551','554','559','564','568','573','600','601','602','603','604','605','606','607','608','609','610','611','612','613','614','615','616','617','618','619','620','621','622'];

function insert_smile(numberofsmile) {
	var SmileData = window.opener.parent.frames['ch_buttons'].document;
	SmileData.FBT.text.focus();
	SmileData.FBT.text.value = SmileData.FBT.text.value + ' :' + numberofsmile + ': ';
}

function view_smiles(){
	document.write("<FONT class=freetxt><b>Примечание</b>. Разрешено не более 3 смайлов в одном сообщении.<br>");
	document.write("<center><a href=# onclick='window.close()'><font class=nickname><b>Закрыть</b></font></a></center><br>");
	for(csm=0; csm<smiles.length; csm++){
		document.write("<a href=# onclick=\"insert_smile('"+smiles[csm]+"')\"><img src='/img/chat/smiles/smiles_"+smiles[csm]+".gif' border=0></a> ");
	}
}