<tr>
    <td>
        <script src="/js/achievements.js"></script>
        <?php include($_SERVER["DOCUMENT_ROOT"] . "/inc/achievements.php");

        $checkAchieve = explode("|", $player['achievements']);
        $achievements = explode("|", $player['achievements']);
        $wins = explode("|", $player['wins']);
        if ($player['umen'] == '') {
            $player['umen'] = "||||||||||||||||||||||||||||||||||||";
        }
        $um = explode("|", $player['umen']);
        $json = json_encode($um);
        $json2 = json_encode($wins);
        $regDate = $player['bdaypers'];
        $currentDate = date('y-m-d H:m:s');
        $gameDate = date_diff($regDate, $currentDate);
        $gameDate = floor($gameDate / 31536000);
        $json3 = json_encode($gameDate);
        $lesnik = $player['les'];
        $fisher = $player['fish_skill'];
        $travnik = $player['trav'];
        $alchemist = $player['alhim'];
        $student = $player['good_pupils_count'];
        $vzlom = $player['vzlomshik_nav'];
        $json4 = json_encode($lesnik);
        $json5 = json_encode($travnik);
        $json6 = json_encode($alchemist);
        $json7 = json_encode($fisher);
        $json8 = json_encode($student);
        $json1 = json_encode($achievements);
        $json9 = json_encode($vzlom);

        $lr = 'LR';
        $dlr = 'Изумруд';
        $rim = array('I', 'II', 'III', 'IV', 'V', 'VI', 'VII', 'VIII', 'IX', 'X');

        $nagrada = array(
            1 => array(0, 3000, 7000, 15000, 25000, 50000, 100000, 200000, 400000, 800000, 1600000),    //Гладиатор
            2 => array(0, 5000, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000),    //Охотник за головами
            3 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            11 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            12 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            13 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            14 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            4 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            5 => array(0, 4000, 7000, 10000, 13000, 16000, 19000, 22000, 25000, 28000, 31000),    //Наставник
            6 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Ветеран
            7 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            8 => array(0, 4000, 7000, 10000, 13000, 16000, 19000, 22000, 25000, 28000, 31000),    //Охотник за головами
            9 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            20 => array(0, 2000, 4000, 6000, 8000, 10000, 12000, 14000, 16000, 18000, 20000),    //Травник
            30 => array(0, 2000, 4000, 6000, 8000, 10000, 12000, 14000, 16000, 18000, 20000),    //Лесоруб
            40 => array(0, 2000, 4000, 6000, 8000, 10000, 12000, 14000, 16000, 18000, 20000),    //Рыбак
            50 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            60 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            80 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            100 => array(0, 2000, 4000, 6000, 8000, 10000, 12000, 14000, 16000, 18000, 20000),    //Алхимик
            150 => array(0, 7000, 10000, 13000, 16000, 19000, 22000, 25000, 28000, 31000, 2560000)            //Доктор
        );
        $nagrada1 = array(
            1 => array(0, 0, 0, 0, 0, 0, 0, 0, 20, 35, 50),    //Гладиатор
            2 => array(0, 0, 0, 0, 0, 0, 0, 0, 20, 35, 50),    //Охотник за головами
            3 => array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),    //Охотник за головами
            11 => array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),    //Охотник за головами
            12 => array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),    //Охотник за головами
            13 => array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),    //Охотник за головами
            14 => array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),    //Охотник за головами
            4 => array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),    //Охотник за головами
            5 => array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),    //Охотник за головами
            6 => array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),    //Охотник за головами
            7 => array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),    //Охотник за головами
            8 => array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),    //Охотник за головами
            9 => array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),    //Охотник за головами
            20 => array(0, 0, 0, 0, 0, 0, 0, 0, 20, 35, 50),    //Охотник за головами
            30 => array(0, 0, 0, 0, 0, 0, 0, 0, 20, 35, 50),    //Охотник за головами
            40 => array(0, 0, 0, 0, 0, 0, 0, 0, 20, 35, 50),    //Охотник за головами
            50 => array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),    //Охотник за головами
            60 => array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),    //Охотник за головами
            80 => array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),    //Охотник за головами
            100 => array(0, 0, 0, 0, 0, 0, 0, 0, 20, 35, 50),    //Алхимик
            150 => array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)            //Доктор
        );
        $nada = array(
            1 => array(0, 1000, 3000, 7000, 10000, 15000, 22000, 30000, 40000, 65000, 80000),    //Гладиатор
            2 => array(0, 1000, 3000, 7000, 10000, 15000, 22000, 30000, 40000, 65000, 80000),    //Охотник за головами
            3 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            11 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            12 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            13 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            14 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            4 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            5 => array(0, 1, 3, 5, 7, 9, 11, 13, 15, 17, 19),    //Наставник
            6 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Ветеран
            7 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            8 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            9 => array(0, 3, 6, 9, 11, 13, 15, 17, 18, 20, 22),    //Взломщик
            20 => array(0, 100, 200, 300, 400, 500, 600, 750, 900, 1050, 1250),    //Травник
            30 => array(0, 100, 200, 300, 400, 500, 600, 750, 900, 1050, 1250),    //Лесоруб
            40 => array(0, 100, 200, 300, 400, 500, 600, 750, 900, 1050, 1250),    //Рыбак
            50 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            60 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            80 => array(0, 10000, 20000, 40000, 80000, 160000, 320000, 640000, 1280000, 2560000, 2560000),    //Охотник за головами
            100 => array(0, 100, 200, 300, 400, 500, 600, 750, 900, 1050, 1250),    //Алхимик
            150 => array(0, 7000, 10000, 13000, 16000, 19000, 22000, 25000, 28000, 31000, 2560000)            //Доктор
        );

        $achs = array(
            array(
                1 => 'Гладиатор',
                2 => 'Охотник за головами',
                //3=>'Два года с нами!'
            ),
            array(
                //11=>'Разбойник',
                //12=>'Слуга Локара',
                //13=>'Вивисектор',
                //14=>'Защитник'
            ),
            array(
                //4=>'Поцелуй Витель',
                5 => 'Наставник',
                //6=>'Ветеран',
                //7=>'Полоса Везения',
                //8=>'Любимец Ирдиса',
                9 => 'Взломщик'),
            array(
                20 => 'Травник',
                30 => 'Лесоруб',
                40 => 'Рыбак',
                //50=>'Купец',
                //60=>'Шахтер',
                //80=>'Ювелир',
                100 => 'Алхимик',
                //150=>'Доктор'
            ));

        $rim1 = array(
            1 => 'Побед в PvP',
            2 => 'Побед над ботами',
            3 => 'Два года с нами!',
            11 => 'Разбойник',
            12 => 'Слуга Локара',
            13 => 'Вивисектор',
            14 => 'Защитник',
            4 => 'Поцелуй Витель',
            5 => 'Наставник',
            6 => 'Ветеран',
            7 => 'Полоса Везения',
            8 => 'Любимец Ирдиса',
            9 => 'Взломщик',
            20 => 'Умение травник',
            30 => 'Умение лесоруб',
            40 => 'Умение рыбалов',
            50 => 'Купец',
            60 => 'Шахтер',
            80 => 'Ювелир',
            100 => 'Умение алхимик',
            150 => 'Доктор');

        $rim2 = array(
            1 => $wins[0],
            2 => $wins[2],
            3 => 'Два года с нами!',
            11 => 'Разбойник',
            12 => 'Слуга Локара',
            13 => 'Вивисектор',
            14 => 'Защитник',
            4 => 'Поцелуй Витель',
            5 => $student,
            6 => $currentDate,
            7 => 'Полоса Везения',
            8 => 'Любимец Ирдиса',
            9 => $vzlom,
            20 => $travnik,
            30 => $lesnik,
            40 => $fisher,
            50 => 'Купец',
            60 => 'Шахтер',
            80 => 'Ювелир',
            100 => $alchemist,
            150 => 'Доктор');


        ?>
        <script> var um = <?=$json?>;
            var achievements = <?=$json1?>;
            var wins = <?=$json2?>;
            var gameDate = <?=$json3?>;
            var lesnik = <?=$json4?>;
            var travnik = <?=$json5?>;
            var alchemist = <?=$json6?>;
            var fisher = <?=$json7?>;
            var student = <?=$json8?>;
            var vzlom = <?=$json9?>;
        </script>
        <table width="100%" border="0">
            <tr>
                <td width=100%>
                    <div class="inside">
                        <div style="margin: 10px;">
                            <table class="tbl1" width="760" border="0">
                                <tr>
                                    <th colspan="4" align="center">Легендарные достижения</th>
                                </tr>
                                <tr>
                                    <td align="center">

                                        <table cellpadding="2" cellspacing="1" width="95%" align="center"
                                               style="border:1px solid #e2e2e2;">
                                            <tr>
                                                <td bgcolor="#e2e2e2" align="center">
                                                    <input type="button" class="lbut" value="Боевые достижения"
                                                           onclick="table1_onclick()"/>

                                                    <input type="button" class="lbut" value="Особые достижения"
                                                           onclick="table3_onclick()"/>
                                                    <input type="button" class="lbut" value="Мирные достижения"
                                                           onclick="table4_onclick()"/>
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    <?
                                                    foreach ($achs as $key => $ach_t) {
                                                        ?>
                                                        <table id="table<?= $key + 1 ?>_p"
                                                               align="center"<?= (($key != 0) ? 'style="display:none"' : '') ?>>
                                                            <?
                                                            foreach ($ach_t as $key1 => $ach) {
                                                                ?>
                                                                <tr>
                                                                    <?
                                                                    for ($i = 1; $i <= 10; $i++) {
                                                                        ?>
                                                                        <td>
                                                                            <div>
                                                                                <img id="<?= $key1 ?>_<?= $i ?>"
                                                                                     class="img_progress"
                                                                                     style="float: left; width: 56px; height: 56px; background: url(http://img.legendbattles.ru/achievement/<?= $key1 ?>/a_<?= $key1 ?>_<?= $i ?>.gif);"
                                                                                     width="56" height="56"
                                                                                     onmouseover="tooltip(this,'<b><?= $ach ?> <?= $rim[$i - 1] ?></b><br><?= $rim1[$key1] ?>: <?= $rim2[$key1] ?> / <?= $nada[$key1][$i] ?><br>Награда: <?= $nagrada[$key1][$i] ?> <?= $lr ?> <?= $nagrada1[$key1][$i] ?> <?= $dlr ?>')"
                                                                                     onmouseout="hide_info(this)"/>
                                                                            </div>
                                                                        </td>
                                                                        <?
                                                                    }
                                                                    ?>
                                                                </tr>
                                                                <?
                                                            }
                                                            ?>
                                                        </table>
                                                        <?
                                                    }
                                                    ?>
                                            <tr>
                                                <td align="left">
                                                    <hr>
                                                    <font color="red"> Внимание!</font> <font color="#0066CC">Наведите
                                                        на картинку чтобы увидеть ваш бонус за достижение (не забываем
                                                        выйти на локацию, и потом нажать инвентарь)</font>
                                                    <br><font color="red"> Внимание!</font> <font color="#0066CC">Чтобы
                                                        вам засчитало бонус, вам нужно зайти на эту страницу</font>
                                                    <br><font color="red"> Внимание!</font> <font color="#0066CC">Призы
                                                        за достижения выдаются <b>Автоматически</b></font>
                                                    <br><font color="red"> Внимание!</font> <font color="#0066CC">Накрутка
                                                        каратеся (мультами) <b>баном всех аккаунтов</b>, разбан будет
                                                        стоить 500 DLR, думайте прежде чем накручивать победы.</font>
                                                    <div id="floatTip"></div>
                                                    <?php
                                                    checkAchievements($um, $wins, $checkAchieve, $gameDate, $travnik, $fisher, $lesnik, $alchemist, $student, $vzlom); ?>
                                                    <script>doneAchieve(achievements, um, wins, gameDate, travnik, fisher, lesnik, alchemist, student, vzlom);</script>
