<script src="/js/achievements.js"></script>
<?php include($_SERVER["DOCUMENT_ROOT"]."/gameplay/inc/achievements.php");

$checkAchieve = explode("|",$player['achievements']);
$achievements = explode("|",$player['achievements']);
$wins=explode("|",$player['wins']);
if($player['umen']==''){$player['umen']="||||||||||||||||||||||||||||||||||||";}
$um=explode("|",$player['umen']);
$register_time    =  $player['bdaypers'];
$timestamp        = time()-$register_time;
$times = date( 'H С‡: i Рј: s СЃ ', $timestamp );
$days  = floor($timestamp / 86400);
$con_time = $days." Рґ. ".$times; 
$json = json_encode($um);
$json2 = json_encode($wins);
$json3 = json_encode($days);
$lesnik = $player['les'];
$fisher = $player['fish_skill'];
$travnik = $player['trav'];
$alchemist = $player['alhim'];
$student = $player['good_pupils_count'];
$vzlom = $player['vzlomshik_exp'];
$json4 = json_encode($lesnik);
$json5 = json_encode($travnik);
$json6 = json_encode($alchemist);
$json7 = json_encode($fisher);
$json8 = json_encode($student);
$json1 = json_encode($achievements);
$json9 = json_encode($vzlom);

$rim = array('I','II','III','IV','V','VI','VII','VIII','IX','X');

$nagrada = array(
	1 => array(0,3000, 7000,15000,25000,50000,100000,200000,400000,800000,1600000),			//Гладиатор
	2 => array(0,5000, 10000,20000,40000,80000,160000,320000,640000,1280000,2560000),		//Охотник за головами
	3 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),		//Охотник за головами
	11 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),	//Охотник за головами
	12 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),	//Охотник за головами
	13 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),	//Охотник за головами
	14 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),	//Охотник за головами
	4 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),		//Охотник за головами
	5 => array(0,4000,7000,10000,13000,16000,19000,22000,25000,28000,31000),				//Наставник
	6 => array(0,1,2,3,4,5,6,7,8,9,10),		//Ветеран
	7 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),		//Охотник за головами
	8 => array(0,4000,7000,10000,13000,16000,19000,22000,25000,28000,31000),				//Охотник за головами
	9 => array(0,400,700,1000,3000,6000,9000,12000,15000,18000,21000),		//Охотник за головами
	20 => array(0,2000,4000,6000,8000,10000,12000,14000,16000,18000,20000),					//Травник
	30 => array(0,2000,4000,6000,8000,10000,12000,14000,16000,18000,20000),					//Лесоруб
	40 => array(0,2000,4000,6000,8000,10000,12000,14000,16000,18000,20000),					//Рыбак
	50 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),	//Охотник за головами
	60 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),	//Охотник за головами
	80 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),	//Охотник за головами
	100 => array(0,2000,4000,6000,8000,10000,12000,14000,16000,18000,20000),				//Алхимик
	150 => array(0,7000,10000,13000,16000,19000,22000,25000,28000,31000,2560000)			//Доктор
);
$nagrada1 = array(
	1 => array(0,0,0,0,0,0,0,0,20,35,50),	//Гладиатор
	2 => array(0,0,0,0,0,0,0,0,20,35,50),	//Охотник за головами
	3 => array(0,0,0,0,0,0,0,0,0,0,0),		//Охотник за головами
	11 => array(0,0,0,0,0,0,0,0,0,0,0),		//Охотник за головами
	12 => array(0,0,0,0,0,0,0,0,0,0,0),		//Охотник за головами
	13 => array(0,0,0,0,0,0,0,0,0,0,0),		//Охотник за головами
	14 => array(0,0,0,0,0,0,0,0,0,0,0),		//Охотник за головами
	4 => array(0,0,0,0,0,0,0,0,0,0,0),		//Охотник за головами
	5 => array(0,0,0,0,0,0,0,0,0,0,0),		//Охотник за головами
	6 => array(0,0,0,0,0,0,0,0,0,0,0),		//Ветеран
  7 => array(0,0,0,0,0,0,0,0,0,0,0),		//Охотник за головами
	8 => array(0,0,0,0,0,0,0,0,0,0,0),		//Охотник за головами
	9 => array(0,0,0,0,0,0,0,0,0,0,0),		//Охотник за головами
	20 => array(0,0,0,0,0,0,0,0,20,35,50),	//Охотник за головами
	30 => array(0,0,0,0,0,0,0,0,20,35,50),	//Охотник за головами
	40 => array(0,0,0,0,0,0,0,0,20,35,50),	//Охотник за головами
	50 => array(0,0,0,0,0,0,0,0,0,0,0),		//Охотник за головами
	60 => array(0,0,0,0,0,0,0,0,0,0,0),		//Охотник за головами
	80 => array(0,0,0,0,0,0,0,0,0,0,0),		//Охотник за головами
  100 => array(0,0,0,0,0,0,0,0,20,35,50),	//Алхимик
	150 => array(0,0,0,0,0,0,0,0,0,0,0)		//Доктор
);
$nada = array(
	1 => array(0,1000, 3000,7000,10000,15000,22000,30000,40000,65000,80000),				//Гладиатор
	2 => array(0,1000, 3000,7000,10000,15000,22000,30000,40000,65000,80000),				//Охотник за головами
	3 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),		//Охотник за головами
	11 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),	//Охотник за головами
	12 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),	//Охотник за головами
	13 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),	//Охотник за головами
	14 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),	//Охотник за головами
	4 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),		//Охотник за головами
	5 => array(0,1,3,5,7,9,11,13,15,17,19),													//Наставник
	6 => array(0,1,2,3,4,5,6,7,8,9,10),		//Ветеран
	7 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),		//Охотник за головами
	8 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),		//Охотник за головами
	9 => array(0,100,250,500,780,900,1080,2080,3780,4780,5780),												//Взломщик
	20 => array(0,100,200,300,400,500,600,750,900,1050,1250),								//Травник
	30 => array(0,100,200,300,400,500,600,750,900,1050,1250),								//Лесоруб
	40 => array(0,100,200,300,400,500,600,750,900,1050,1250),								//Рыбак
	50 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),	//Охотник за головами
	60 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),	//Охотник за головами
	80 => array(0,10000,20000,40000,80000,160000,320000,640000,1280000,2560000,2560000),	//Охотник за головами
	100 => array(0,100,200,300,400,500,600,750,900,1050,1250),								//Алхимик
	150 => array(0,7000,10000,13000,16000,19000,22000,25000,28000,31000,2560000)			//Доктор
);

$achs = array(
	array( 
	1=>'Гладиатор',
  2=>'Охотник за головами',
  //3=>'Два года с нами!'
	),
	array( 
  //11=>'Разбойник',
  //12=>'Слуга Локара',
  //13=>'Вивисектор',
  //14=>'Защитник'
	),
	array( 
	//4=>'Поцелуй Витель',
  5=>'Наставник',
  6=>'Ветеран',
  //7=>'Полоса Везения',
  //8=>'Любимец Ирдиса',
  9=>'Кладоискатель'),
	array( 
	20=>'Травник', 
	30=>'Лесоруб', 
	40=>'Рыбак', 
	//50=>'Купец', 
	//60=>'Шахтер', 
	//80=>'Ювелир',	
	100=>'Алхимик', 
	//150=>'Доктор'
	));
	
	$rim1 = array(
	1=>'Побед в PvP',
  2=>'Побед над ботами',
  3=>'Два года с нами!',
  11=>'Разбойник',
  12=>'Слуга Локара',
  13=>'Вивисектор',
  14=>'Защитник',
	4=>'Поцелуй Витель',
  5=>'Наставник',
  6=>'Годы в  игре',
  7=>'Полоса Везения',
  8=>'Любимец Ирдиса',
  9=>'Взломщик',
	20=>'Умение травник', 
	30=>'Умение лесоруб', 
	40=>'Умение рыбалов', 
	50=>'Купец', 
	60=>'Шахтер', 
	80=>'Ювелир',	
	100=>'Умение алхимик', 
	150=>'Доктор');
	
	$rim2 = array(
	1=> $wins[0],
  2=> $wins[2],
  3=>'Два года с нами!',
  11=>'Разбойник',
  12=>'Слуга Локара',
  13=>'Вивисектор',
  14=>'Защитник',
	4=>'Поцелуй Витель',
  5=> $student,
  6=> $achievements[9],
  7=>'Полоса Везения',
  8=>'Любимец Ирдиса',
  9=> $vzlom,
	20=> $travnik, 
	30=> $lesnik, 
	40=> $fisher, 
	50=>'Купец', 
	60=>'Шахтер', 
	80=>'Ювелир',	
	100=> $alchemist, 
	150=>'Доктор');
	



?>
<script> var um = <?=$json?>; 
var achievements = <?=$json1?>;
var wins = <?=$json2?>; 
var days = <?=$json3?>;
var lesnik = <?=$json4?>;
var travnik = <?=$json5?>;
var alchemist = <?=$json6?>;
var fisher = <?=$json7?>;
var student = <?=$json8?>;
var vzlom = <?=$json9?>;
</script>
<div class="block achiv">
	<div class="header">
		<span>Легендарные достижения</span>
	</div>
	<div class="content">
		<div class="save">
			<input type="button" class="lbut" value="Боевые достижения" onclick="table1_onclick()"/>
			<input type="button" class="lbut" value="Особые достижения" onclick="table3_onclick()" />
			<input type="button" class="lbut" value="Мирные достижения" onclick="table4_onclick()" />
		</div>
<?
foreach ($achs as $key => $ach_t){
?>
		<table id="table<?=$key+1?>_p" align="center"<?=(($key!=0)?'style="display:none"':'')?>>
<?
foreach ($ach_t as $key1 => $ach){
?>
			<tr>
<?
for ($i=1;$i<=10;$i++) {
?>
				<td>
					<div>
						<img id="<?=$key1?>_<?=$i?>" class="img_progress" style="float: left; width: 56px; height: 56px; background: url(/img/achievement/<?=$key1?>/a_<?=$key1?>_<?=$i?>.gif);" width="56" height="56" onmouseover="tooltip(this,'<b><?=$ach?> <?=$rim[$i-1]?></b><br><?=$rim1[$key1]?>: <?=$rim2[$key1]?> / <?=$nada[$key1][$i]?><br>Награда:<br> <?=lr($nagrada[$key1][$i])?><br> <?=$nagrada1[$key1][$i]?><img src=/img/razdor/emerald.png valign=middle width=14 height=14>')" onmouseout="hide_info(this)" />
					</div>
				</td>
<?
}
?>
			</tr>
<?
}
?>
		</table>
<?
}
?>
		<div>Наведите на картинку чтобы увидеть ваш бонус за достижение (не забываем выйти на локацию, и потом нажать инвентарь)</div>
		<div>Чтобы вам засчитало бонус, вам нужно зайти на эту страницу</div>
		<div>Призы за достижения выдаются <b>Автоматически</b></div>
		<div>Накрутка каратеся (мультами) <b>баном всех аккаунтов</b>, разбан будет стоить 500 Изумруд, думайте прежде чем накручивать победы.</div>
		<div id="floatTip"></div>
<?checkAchievements($um, $wins, $checkAchieve, $days, $travnik, $fisher, $lesnik, $alchemist, $student, $vzlom); ?>
		<script>doneAchieve(achievements, um, wins, days, travnik, fisher, lesnik, alchemist, student, vzlom);</script>
	</div>
</div>