<?php

	function lr($lr) {
		$b = $lr % 100;
		$s = intval(($lr % 10000) / 100);
		$g = intval($lr / 10000);
        return (($g) ? $g . ' <img src=http://img.legendbattles.ru/image/gold.png width=14 height=14 valign=middle title=Золото>  ' : '') . (($s) ? $s . ' <img src=http://img.legendbattles.ru/image/silver.png width=14 height=14 valign=middle title=Серебро> ' : '') . (($b) ? $b . ' <img src=http://img.legendbattles.ru/image/bronze.png width=14 height=14 valign=middle title=Бронза> ' : '');
	}
// mZer0ne Domain verification
if(getenv("HTTP_HOST") != 'legendbattles.ru')
	exit('Invalid License: &copy; <a href="http://dapf.us/members/mzer0ne.1341/" target="_blank">mZer0ne</b>');
// Source
$SvParams = array(
	'DECODE'=>array("LI"=>"72","HP"=>"73","MP"=>"74","US"=>"75","R_ST"=>"76","R_MF"=>"77","RB_ST"=>"78","RB_MF"=>"79"),
	'ENCODE'=>array("72"=>"LI","73"=>"HP","74"=>"MP","75"=>"US","76"=>"R_ST","77"=>"R_MF","78"=>"RB_ST","79"=>"RB_MF")
);
$ItemsParams = array(
	'DECODE'=>array("expbonus"=>"72","massbonus"=>"73"),
	'ENCODE'=>array("72"=>"expbonus","73"=>"massbonus")
);
// Выбераем типаж вещи и категорию
if ($_GET['type'] == 'items') { // вещи
	if(!empty($_POST)){
        // Декодирываем статы
		$Effects = explode("|", $_POST['param']);
		$ParamFirst = '';
		foreach($Effects as $Effect){
			$Params = explode("@", $Effect);
			$ParamFirst .= ($ItemsParams['ENCODE'][$Params[0]] ? $ItemsParams['ENCODE'][$Params[0]] : $Params[0]) . "@" . $Params[1] . "|";
		}
		$GetItem['param'] = substr($ParamFirst,0,strlen($ParamFirst)-1);
		$update = '';
		foreach($_POST as $key=>$val){
			$update .= "`".$key."`='".$val."',";
		}
        if (mysqli_query($GLOBALS['db_link'], "UPDATE `items` SET " . substr($update, 0, strlen($update) - 1) . " WHERE `id`='" . intval($_GET['id']) . "'")) {
            echo "<script>parent.jAlert('Изменения сохранены.');</script>";
		}		
	}
	$Editor = 'items';
	$GetItem = mysqli_fetch_assoc(mysqli_query($GLOBALS['db_link'],"SELECT * FROM `items` WHERE `id`='".intval($_GET['id'])."'"));

    // Декодирываем статы
	$Effects = explode("|", $GetItem['param']);
	$ParamFirst = '';
	foreach($Effects as $Effect){
		$Params = explode("@", $Effect);
		$ParamFirst .= ($ItemsParams['DECODE'][$Params[0]] ? $ItemsParams['DECODE'][$Params[0]] : $Params[0]) . "@" . $Params[1] . "|";
	}
	$GetItem['param'] = substr($ParamFirst,0,strlen($ParamFirst)-1);
} else if ($_GET['type'] == 'tavern') { // таверна
	if(!empty($_POST)){
        // Собираем эффекты в таверну
		$Effects = explode("|", $_POST['param']);
		$EncodeParams = '';
		foreach($Effects as $Effect){
			$Params = explode("@", $Effect);
			if($Params[0] == '78' or $Params[0] == '79'){
				$tmpParams = explode("-", $Params[1]);
				$EncodeParams .= $SvParams['ENCODE'][$Params[0]]."|".$tmpParams[0]."|".intval($_POST['time'])."|".$tmpParams[1]."|1@";
			}else if($Params[0] == '73' or $Params[0] == '74' or $Params[0] == '75'){
				$EncodeParams .= ($SvParams['ENCODE'][$Params[0]] ? $SvParams['ENCODE'][$Params[0]] : $Params[0]) . "|" . $Params[1] . "@";
			}else{
				$EncodeParams .= ($SvParams['ENCODE'][$Params[0]] ? $SvParams['ENCODE'][$Params[0]] : $Params[0]) . "|" . $Params[1] . "|".intval($_POST['time'])."@";
			}
		}
		if($_POST['need'] != ''){
			$Effects = explode("|", $_POST['need']);
			$EncodeParams .= "EFF|".intval($_POST['time'])."@";
			foreach($Effects as $Effect){
				$Params = explode("@", $Effect);
				if($Params[0] == '78' or $Params[0] == '79'){
					$tmpParams = explode("-", $Params[1]);
					$EncodeParams .= $SvParams['ENCODE'][$Params[0]]."|".$tmpParams[0]."|".intval($_POST['time'])."|".$tmpParams[1]."|-1@";
				}else if($Params[0] == '73' or $Params[0] == '74' or $Params[0] == '75'){
					$EncodeParams .= ($SvParams['ENCODE'][$Params[0]] ? $SvParams['ENCODE'][$Params[0]] : $Params[0]) . "|" . $Params[1] . "@";
				}else{
					$EncodeParams .= ($SvParams['ENCODE'][$Params[0]] ? $SvParams['ENCODE'][$Params[0]] : $Params[0]) . "|" . $Params[1] . "|".intval($_POST['time'])."@";
				}
			}
		}
		$_POST['effects'] = substr($EncodeParams,0,strlen($EncodeParams)-1);
		
		unset($_POST['param'], $_POST['need'], $_POST['time']);
	
		$update = '';
		foreach($_POST as $key=>$val){
			$update .= "`".$key."`='".$val."',";
		}
		if(mysqli_query($GLOBALS['db_link'],"UPDATE `tavern` SET " . substr($update,0,strlen($update)-1) . " WHERE `id`='".intval($_GET['id'])."'")){
            echo "<script>parent.jAlert('Изменения сохранены.');</script>";
		}
	}
	
	$Editor = 'tavern';
	$GetItem = mysqli_fetch_assoc(mysqli_query($GLOBALS['db_link'],"SELECT * FROM `tavern` WHERE `id`='".intval($_GET['id'])."'"));

    // Разбераем Эффекты
	$Effects = explode("@", $GetItem['effects']);
	$ParamFirst = $ParamSecond = '';
	$EffectTime = 0;
	$Step = 0;
	foreach($Effects as $Effect){
		$Params = explode("|", $Effect);
		if($Step == 0 and $Params[0] != 'EFF'){
			if($Params[0] == 'RB_ST' or $Params[0] == 'RB_MF'){
				$ParamFirst .= ($SvParams['DECODE'][$Params[0]] ? $SvParams['DECODE'][$Params[0]] : $Params[0]) . '@' . $Params[1] . '-' . $Params[3] . '|';
			}else{
				$ParamFirst .= ($SvParams['DECODE'][$Params[0]] ? $SvParams['DECODE'][$Params[0]] : $Params[0]) . '@' . $Params[1] . '|';
			}
		}else if($Step == 1){
			if($Params[0] == 'RB_ST' or $Params[0] == 'RB_MF'){
				$ParamSecond .= ($SvParams['DECODE'][$Params[0]] ? $SvParams['DECODE'][$Params[0]] : $Params[0]) . '@' . $Params[1] . '-' . $Params[3] . '|';
			}else{
				$ParamSecond .= ($SvParams['DECODE'][$Params[0]] ? $SvParams['DECODE'][$Params[0]] : $Params[0]) . '@' . $Params[1] . '|';
			}
		}
		$EffectTime = $Params[2] ? $Params[2] : $EffectTime;
		if($Params[0] == 'EFF'){
			$Step = 1;
		}
	}
    // Назначаем переменные
	$GetItem['need'] = substr($ParamSecond,0,strlen($ParamSecond)-1);
	$GetItem['param'] = substr($ParamFirst,0,strlen($ParamFirst)-1);
	$GetItem['dd_price'] = $GetItem['count'];
	$GetItem['gif'] = $GetItem['img'];
	$GetItem['level'] = $GetItem['LI'];
	$GetItem['massa'] = $EffectTime;
}

echo'<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" id="html">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<script language="JavaScript" src="/js/editor/'.$Editor.'.js" type="text/javascript"></script>
<link type="text/css" rel="stylesheet" href="/css/meditor.css" />
</head>
<body>
<script type="text/javascript">
var params = ["'.$GetItem['name'].'","'.$GetItem['gif'].'","'.lr($GetItem['price']).'","'.$GetItem['dd_price'].'","'.$GetItem['type'].'","'.$GetItem['slot'].'","'.$GetItem['level'].'","'.$GetItem['massa'].'","'.$GetItem['param'].'","'.$GetItem['need'].'","'.$GetItem['block'].'"];
';
if($_GET['type'] == 'items'){
    echo 'var all_params = [[["0","Гравировка",""],["1","Удар",""],["2","Долговечность",""],["3","Карманов",""],["4","Материал",""],["5","Уловка",""],["6","Точность",""],["7","Сокрушение",""],["8","Стойкость",""],["9","Класс брони",""],["10","Пробой брони",""],["11","Пробой колющим ударом","%"],["12","Пробой режущим ударом","%"],["13","Пробой проникающим ударом","%"],["14","Пробой пробивающим ударом","%"],["15","Пробой рубящим ударом","%"],["16","Пробой карающим ударом","%"],["17","Пробой отсекающим ударом","%"],["18","Пробой дробящим ударом","%"],["19","Защита от колющих ударов",""],["20","Защита от режущих ударов",""],["21","Защита от проникающих ударов",""],["22","Защита от пробивающих ударов",""],["23","Защита от рубящих ударов",""],["24","Защита от карающих ударов",""],["25","Защита от отсекающих ударов",""],["26","Защита от дробящих ударов",""],["27","НР",""],["28","Очки действия",""],["29","Мана",""],["30","Мощь",""],["31","Проворность",""],["32","Везение",""],["33","Здоровье",""],["34","Разум",""],["35","Сноровка",""],["36","Владение мечами","%"],["37","Владение топорами","%"],["38","Владение дробящим оружием","%"],["39","Владение ножами","%"],["40","Владение метательным оружием","%"],["41","Владение алебардами и копьями","%"],["42","Владение посохами","%"],["43","Владение экзотическим оружием","%"],["44","Владение двуручным оружием","%"],["45","Магия огня","%"],["46","Магия воды","%"],["47","Магия воздуха","%"],["48","Магия земли","%"],["49","Сопротивление магии огня","%"],["50","Сопротивление магии воды","%"],["51","Сопротивление магии воздуха","%"],["52","Сопротивление магии земли","%"],["53","Воровство","%"],["54","Осторожность","%"],["55","Скрытность","%"],["56","Наблюдательность","%"],["57","Торговля","%"],["58","Странник","%"],["59","Рыболов","%"],["60","Лесоруб","%"],["61","Ювелирное дело","%"],["62","Самолечение","%"],["63","Оружейник","%"],["64","Доктор","%"],["65","Самолечение","%"],["66","Быстрое восстановление маны","%"],["67","Лидерство","%"],["68","Алхимия","%"],["69","Развитие горного дела","%"],["70","Травничество","%"],["71","Коэффициент","%"],["72","Бонус опыта","%"],["73","Бонус массы",""]],[["28","Очки действия"],[""],["30","Мощь"],["31","Проворность"],["32","Везение"],["33","Здоровье"],["34","Разум"],["35","Сноровка"],["36","Владение мечами"],["37","Владение топорами"],["38","Владение дробящим оружием"],["39","Владение ножами"],["40","Владение метательным оружием"],["41","Владение алебардами и копьями"],["42","Владение посохами"],["43","Владение экзотическим оружием"],["44","Владение двуручным оружием"],["45","Магия огня"],["46","Магия воды"],["47","Магия воздуха"],["48","Магия земли"],[""],[""],[""],[""],["53","Воровство"],["54","Осторожность"],["55","Скрытность"],["56","Наблюдательность"],["57","Торговля"],["58","Странник"],["59","Рыболов"],["60","Лесоруб"],["61","Ювелирное дело"],["62","Самолечение"],["63","Оружейник"],["64","Доктор"],["65","Самолечение"],["66","Быстрое восстановление маны"],["67","Лидерство"],["68","Алхимия"],["69","Развитие горного дела"],["70","Травничество"]]];';
}else if($_GET['type'] == 'tavern'){
    echo 'var all_params = [[[""],["1","Удар",""],["2","Долговечность",""],["3","Карманов",""],["4","Материал",""],["5","Уловка",""],["6","Точность",""],["7","Сокрушение",""],["8","Стойкость",""],["9","Класс брони",""],["10","Пробой брони",""],["11","Пробой колющим ударом","%"],["12","Пробой режущим ударом","%"],["13","Пробой проникающим ударом","%"],["14","Пробой пробивающим ударом","%"],["15","Пробой рубящим ударом","%"],["16","Пробой карающим ударом","%"],["17","Пробой отсекающим ударом","%"],["18","Пробой дробящим ударом","%"],["19","Защита от колющих ударов",""],["20","Защита от режущих ударов",""],["21","Защита от проникающих ударов",""],["22","Защита от пробивающих ударов",""],["23","Защита от рубящих ударов",""],["24","Защита от карающих ударов",""],["25","Защита от отсекающих ударов",""],["26","Защита от дробящих ударов",""],["27","НР",""],["28","Очки действия",""],["29","Мана",""],["30","Мощь",""],["31","Проворность",""],["32","Везение",""],["33","Здоровье",""],["34","Разум",""],["35","Сноровка",""],["36","Владение мечами","%"],["37","Владение топорами","%"],["38","Владение дробящим оружием","%"],["39","Владение ножами","%"],["40","Владение метательным оружием","%"],["41","Владение алебардами и копьями","%"],["42","Владение посохами","%"],["43","Владение экзотическим оружием","%"],["44","Владение двуручным оружием","%"],["45","Магия огня","%"],["46","Магия воды","%"],["47","Магия воздуха","%"],["48","Магия земли","%"],["49","Сопротивление магии огня","%"],["50","Сопротивление магии воды","%"],["51","Сопротивление магии воздуха","%"],["52","Сопротивление магии земли","%"],["53","Воровство","%"],["54","Осторожность","%"],["55","Скрытность","%"],["56","Наблюдательность","%"],["57","Торговля","%"],["58","Странник","%"],["59","Рыболов","%"],["60","Лесоруб","%"],["61","Ювелирное дело","%"],["62","Самолечение","%"],["63","Оружейник","%"],["64","Доктор","%"],["65","Самолечение","%"],["66","Быстрое восстановление маны","%"],["67","Лидерство","%"],["68","Алхимия","%"],["69","Развитие горного дела","%"],["70","Травничество","%"],["71","Коэффициент","%"],["72","Лимит",""],["73","Восстановление HP",""],["74","Восстановление MP",""],["75","Усталость",""],["76","Случайный стат",""],["77","Случайный МФ",""],["78","Случайный стат(от-до)",""],["79","Случайный МФ(от-до)",""]],[[""],["1","Удар",""],["2","Долговечность",""],["3","Карманов",""],["4","Материал",""],["5","Уловка",""],["6","Точность",""],["7","Сокрушение",""],["8","Стойкость",""],["9","Класс брони",""],["10","Пробой брони",""],["11","Пробой колющим ударом","%"],["12","Пробой режущим ударом","%"],["13","Пробой проникающим ударом","%"],["14","Пробой пробивающим ударом","%"],["15","Пробой рубящим ударом","%"],["16","Пробой карающим ударом","%"],["17","Пробой отсекающим ударом","%"],["18","Пробой дробящим ударом","%"],["19","Защита от колющих ударов",""],["20","Защита от режущих ударов",""],["21","Защита от проникающих ударов",""],["22","Защита от пробивающих ударов",""],["23","Защита от рубящих ударов",""],["24","Защита от карающих ударов",""],["25","Защита от отсекающих ударов",""],["26","Защита от дробящих ударов",""],["27","НР",""],["28","Очки действия",""],["29","Мана",""],["30","Мощь",""],["31","Проворность",""],["32","Везение",""],["33","Здоровье",""],["34","Разум",""],["35","Сноровка",""],["36","Владение мечами","%"],["37","Владение топорами","%"],["38","Владение дробящим оружием","%"],["39","Владение ножами","%"],["40","Владение метательным оружием","%"],["41","Владение алебардами и копьями","%"],["42","Владение посохами","%"],["43","Владение экзотическим оружием","%"],["44","Владение двуручным оружием","%"],["45","Магия огня","%"],["46","Магия воды","%"],["47","Магия воздуха","%"],["48","Магия земли","%"],["49","Сопротивление магии огня","%"],["50","Сопротивление магии воды","%"],["51","Сопротивление магии воздуха","%"],["52","Сопротивление магии земли","%"],["53","Воровство","%"],["54","Осторожность","%"],["55","Скрытность","%"],["56","Наблюдательность","%"],["57","Торговля","%"],["58","Странник","%"],["59","Рыболов","%"],["60","Лесоруб","%"],["61","Ювелирное дело","%"],["62","Самолечение","%"],["63","Оружейник","%"],["64","Доктор","%"],["65","Самолечение","%"],["66","Быстрое восстановление маны","%"],["67","Лидерство","%"],["68","Алхимия","%"],["69","Развитие горного дела","%"],["70","Травничество","%"],["71","Коэффициент","%"],["72","Лимит",""],["73","Восстановление HP",""],["74","Восстановление MP",""],["75","Усталость",""],["76","Случайный стат",""],["77","Случайный МФ",""],["78","Случайный стат(от-до)",""],["79","Случайный МФ(от-до)",""]]];';
}
echo'
ShowEditor();
$("adminMenu").style.display = "none";
$("mainTable").style.width = "100%";
</script>
</body>
</html>';